# Full Data Analysis Case-study (Salaries analysis)

#### Objective:
- Import pandas as pd
- Read Salaries.csv as a dataframe called salary
- Check the head of the DataFrame
- Use the .info() method to find out how many entries there are.
- What is the average BasePay?
- What is the highest amount of OvertimePay in the dataset ?
- Find the job title of any particular person e.g JGARY JIMENEZ ?
- How much does any particular person make e.g GARY JIMENEZ (including benefits)?
- What is the name of highest paid person (including benefits)?
- What is the name of lowest paid person (including benefits)?
- What was the average (mean) BasePay of all employees per year? e.g (2011-2014)
- How many unique job titles are there?
- What are the top 5 most common jobs?

### 1] Libraries & Data Importing

In [158]:
import numpy as np
import pandas as pd

#### Read Salaries.csv as a dataframe called salary

In [161]:
df=pd.read_csv('salaries.csv')

### 2] Data Understanding (Asking Questions)

#### Check the head of the DataFrame

In [165]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

#### Use the .info() method to find out how many entries there are.

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

####  How many rows and columns are there?

In [171]:
df.shape

(148654, 13)

#### Statistical Summary

In [174]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

### 3] Data Wrangling (Cleaning & Manipulation)

#### Are there any missing / duplicated data?

In [178]:
df.isnull()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,False,False,False,False,False,False,True,False,False,False,True,False,True
1,False,False,False,False,False,False,True,False,False,False,True,False,True
2,False,False,False,False,False,False,True,False,False,False,True,False,True
3,False,False,False,False,False,False,True,False,False,False,True,False,True
4,False,False,False,False,False,False,True,False,False,False,True,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,False,False,False,False,False,False,False,False,False,False,True,False,True
148650,False,False,False,True,True,True,True,False,False,False,True,False,True
148651,False,False,False,True,True,True,True,False,False,False,True,False,True
148652,False,False,False,True,True,True,True,False,False,False,True,False,True
148653,False,False,False,False,False,False,False,False,False,False,True,False,True

In [184]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [186]:
df.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Length: 148654, dtype: bool

In [188]:
df.duplicated().sum()

0

### 4] Data Analysis & Visualization (EDA & Statistical Analysis)

#### - What is the average BasePay?

In [192]:
df['BasePay'].mean()

66325.4488404877

#### - What is the highest amount of OvertimePay in the dataset ?

In [195]:
df['OvertimePay'].max()

245131.88

#### - Find the job title of any particular person e.g GARY JIMENEZ ?

In [198]:
df.loc[df["EmployeeName"]=="GARY JIMENEZ","JobTitle"]

1    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

In [200]:
# complete row for GARY JIMENEZ
df.loc[df["EmployeeName"]=="GARY JIMENEZ"]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

#### - How much does any particular person make e.g GARY JIMENEZ (including benefits)?

In [203]:
df.loc[df["EmployeeName"]=="GARY JIMENEZ",'BasePay']+df.loc[df["EmployeeName"]=="GARY JIMENEZ",'TotalPayBenefits']

1    694875.3
dtype: float64

#### - How much does any particular person make e.g JOSEPH DRISCOLL (including benefits)?

In [206]:
df.loc[df["EmployeeName"]=="JOSEPH DRISCOLL",'BasePay']+df.loc[df["EmployeeName"]=="JOSEPH DRISCOLL",'TotalPayBenefits']

24    410871.77
dtype: float64

#### What is the name of highest paid person (including benefits)?

In [209]:
highest = df.loc[(df['BasePay'] + df['TotalPayBenefits']).idxmax()]
name = highest['EmployeeName']
name

'Amy P Hart'

#### What is the name of lowest paid person (including benefits)?

In [212]:
lowest = df.loc[(df['BasePay'] + df['TotalPayBenefits']).idxmin()]
name = lowest['EmployeeName']
name

'Joe Lopez'

#### What was the average (mean) BasePay of all employees per year? e.g (2011-2014) ?

In [215]:
df[df['Year'].isin([2011, 2012, 2013, 2014])].groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [217]:
# Average (mean) BasePay only in 2013
df[df['Year']==2013]['BasePay'].mean()

69630.03021648065

#### How many unique job titles are there?
using function >> nunique()

In [220]:
df['JobTitle'].nunique()

2159

#### What are the top 5 most common jobs?

In [268]:
# Top 5:
Top5= df['JobTitle'].value_counts().head()
Top5

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [270]:
# Bottom 5:
Bottom5= df['JobTitle'].value_counts().tail()
Bottom5

JobTitle
CHIEF HOUSING INSPECTOR                           1
TRAFFIC SIGNAL OPERATOR                           1
COURT COMPUTER FACILITIES COORDINATOR             1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I    1
VICTIM & WITNESS TECHNICIAN                       1
Name: count, dtype: int64

## GOOD LUCK!